{
  "basics": {
    "name": "Kate Frostad",
    "label": "Professional Clinical Mental Health Counselor/Intern",
    "picture": "",
    "email": "katiefrostad@gmail.com",
    "phone": "(509) 994-7257",
    "website": "",
    "summary": "",
    "location": {
      "address": "4707 S Keyes Ct",
      "postalCode": "WA 99224",
      "city": "Spokane",
      "countryCode": "US",
      "region": "Washington"
    },
    "profiles": []
  },
  "work": [
    {
      "company": "Mann-Grandstaff VA Medical Center Behavioral Health Services (BHS) and Healthcare for Homeless Veterans (HCHV), Clinical Mental Health Counseling Intern",
      "position": "Clinical Mental Health Counseling Intern",
      "website": "spokane.va.gov",
      "startDate": "2015-08",
      "endDate": "",
      "summary": "I was one of the 18 interns nationwide (at seven VA Medical Centers; including Canandaigua NY, Houston TX, Spokane WA, Cleveland OH, Syracuse NY, Bay Pines and Tampa, FL) to be accepted into The Department of Veterans Affairs’ (VA) new program which included clinical training opportunities to LPMHC students with clinical experiences within VA’s interprofessional mental health teams. This included physicians, psychologists, social workers, nurses, and other mental health professionals working collaboratively to provide patient care. This initiative was intended to attract and encourage Licensed Professional Mental Health Counselors (LPMHC) to choose VA for employment as part of the VA’s recruitment plan to hire additional mental health care professionals to serve our Veterans. ",
      "highlights": [
        "I am the first in the nation to graduate from this program. *Please note this is stipend paid internship wherein I am operating at a GS-9 capacity",
        "Shared my time between BHS and HCHV locations",
        "Provided individual, family, couples and group therapy using evidence based practices; both in-office and in community outreach/ in Veteran’s homes (primarily under the HUD-VASH program). Group work included Transgender Support, Couples PTSD Symptom Management, Finding Solutions for Suicide",
        "Performed weekly intakes; full mental health assessments including diagnosis and service recommendations for incoming Veterans",
        "Participated in the VA’s only men’s facilitated peer support group for Finding Solutions (promoting zero suicide) in the nation, and advocated for the implementation of this group for female Veterans",
        "Assisted Veterans obtain vocational goals, and made referrals for services including peer support, substance abuse support, inpatient services, and with pursuing educational",
        "Participation on multidisciplinary Home Team meetings",
        "Collaboration with community partners including Goodwill Industries, Frontier Behavioral Health, the Veteran’s Center, CHOICE partners, Food Banks, homeless shelters, group homes, and area hospitals",
        "Utilized Computerized Patient Record System (CPRS) to provide accurate and timely clinical charting and treatment planning to ensure continuity of care and made appropriate referrals when necessary",
        "Utilized technologies including VistA Visual Aid, VistAWeb, CPRS, CPRS Remote Data View, Joint Legacy Viewer (JLV), VA Time and Attendance System (VATAS), Mental Health Suite, Citrix and VA Talent Management System (TMS"
      ]
    },
    {
      "company": "Frontier Behavioral Health (FBH)",
      "position": "Clinical Mental Health Counseling Intern",
      "website": "fbhwa.org",
      "startDate": "2015-01",
      "endDate": "2015-08",
      "summary": "A nonprofit Trauma-Informed Care organization which strives to ensure that individuals of all ages have timely access to mental health services and is the Lead Service Provider in the Regional Support Network. ",
      "highlights": []
    },
    {
      "company": "Elder Services",
      "position": "",
      "website": "",
      "startDate": "",
      "endDate": "",
      "summary": "Completed my Practicum promoting independence and enhanced quality of life for home-dwelling older adults, especially those who are at-risk and isolated. ",
      "highlights": [
        "Provided individual and group therapy using evidence based practices. Group work included Geriatric Men's Support and Elders' Caregiver Support",
        "Community outreach and in-home interdisciplinary clinical case and care management",
        "Assisted clients in developing necessary skills to improve  quality of life and stability in the community",
        "Connected individuals with necessary supports and resources",
        "Direct interdisciplinary cooperation with Psychiatric Services for medication management",
        "Collaboration with community partners including COPES and Adult Protective Services",
        "Caregiver support including Respite and Kinship Care"
      ]
    },
    {
      "company": "Intensive Adult Recovery Services (ARS)",
      "position": "",
      "website": "",
      "startDate": "",
      "endDate": "",
      "summary": "Completed my Summer Internship serving individuals diagnosed with a severe and persistent mental illnesses with complex needs, in office and in their own home, group home or residential facility.",
      "highlights": [
        "Provided individual, family, couples, group and co occurring therapy using evidence based practices both in-office and through community outreach. Group work included Women's Anxiety, Substance Abuse Psycho-education, Substance Abuse Support, Anphetamine Recovery, and Art Therapy",
        "Offered education regarding specific disorder and symptom management and assisted clients in developing necessary skills to improve  quality of life and stability in the community, pursuing educational and vocational goals, and connected individuals with necessary supports and resources",
        "Direct interdisciplinary cooperation with Psychiatry and Primary Care Physicians for medication management and promoting good health",
        "Worked directly with the Crisis Response Team and the Hospital Diversion Team",
        "Worked directly with peer support services for smooth transition from long term psychiatric hospitalization/incarceration to independent living",
        "Collaboration with community partners including Division of Child and Family Services, Child Protective Services (CPS), Police Department, State Psychiatric Hospital,  foster families, schools",
        "Utilized ERMA and Relias technologies to provide accurate and timely clinical charting and to ensure continuity of care and designed treatment plans, using SMART Goal guidelines, that utilized client strengths to achieve their life goals"
      ]
    },
    {
      "company": "Applied Healthcare Associates",
      "position": "Office Manager",
      "website": "ahaspokane.com",
      "startDate": "2009",
      "endDate": "2012",
      "summary": "As Office Manager, I promoted a warm inclusive work environment while maintaining emphasis on improving health through preventative and restorative care.",
      "highlights": [
        "Oversaw staff;  hired, trained, mentored, and performed timely performance reviews; secured and maintained professional credentialing, continuing education requirements, and professional  licensure and insurance.",
        "Oversaw facility operations; performed daily reconciliations along with scheduled projections, lien processing, insurance coordination, recalls, billing, collections, and accounts payable/receivable."
      ]
    },
    {
      "company": "White Glove Cleaning Services",
      "position": "Owner/Operator",
      "website": "",
      "startDate": "2007",
      "endDate": "2009",
      "summary": "As Owner/Operator, I was dedicated to providing exceptional cleaning services for families and professionals alike through valuing our reputation for excellence and customer satisfaction by maintaining focus on our mission of treating each home or office as if it were our own.",
      "highlights": []
    },
    {
      "company": "Memories By Design",
      "position": "Front Office Coordinator",
      "website": "memoriesbydesign.com",
      "startDate": "2005",
      "endDate": "2007",
      "summary": "As Front Office Coordinator I oversaw the process of creating signature Memory Keepsake Tribute Videos that provide comfort, celebrate life and preserve memories through craftsmanship, expertise and compassion.",
      "highlights": [
        "Implemented new productivity software",
        "Managed multi-line phone system, prepared vendor orders, purchasing, shipping and receiving, as well as managing the marketing supplies, manuals, and software."
      ]
    },
    {
      "company": "Pediatric Therapy Specialists",
      "position": "Business Manager",
      "website": "spokanecpt.com",
      "startDate": "2003",
      "endDate": "2005",
      "summary": "As Business Manager, I was committed to the support and growth of my professional team by promoting clinical excellence through continuing education, interdisciplinary teamwork, and community outreach. ",
      "highlights": [
        "Supervised staff, ran staff meetings, performed record keeping audits, daily reconciliations, scheduled projections, accounts payable/receivable, coordinated insurance and counseled families on their treatment options and financial responsibilities."
      ]
    },
    {
      "company": "Home Away from Home Daycare",
      "position": "Owner/Operator",
      "website": "",
      "startDate": "2001",
      "endDate": "2003",
      "summary": "As Owner/Operator, I welcomed children of all abilities, with the commitment to provide quality care, and opportunity for development and learning with a focus on diversity in an atmosphere which fostered a sense of love and belonging.",
      "highlights": []
    },
    {
      "company": "Cornerstone Prosthetics & Orthotics",
      "position": "Office Manager",
      "website": "cornerstonepo.com",
      "startDate": "2000",
      "endDate": "2001",
      "summary": "As office manager I coordinated insurance, scheduling, billing, marketing, amputee support functions, and performed light fittings.",
      "highlights": [
        "Implemented modernized recordkeeping systems",
        "Improved productivity via implementation of GEMBA standards."
      ]
    },
    {
      "company": "Whidbey Dental Associates",
      "position": "Office Manager",
      "website": "whidbeydental.com",
      "startDate": "1999",
      "endDate": "2000",
      "summary": "As office manager, I carried out our mission of providing dental care excellence through Gentle Dentistry where we implemented a holistic approach in which dental care was treated as a critical part of one's health. ",
      "highlights": [
        "Oversaw staff, production, scheduling, and billing, created financial reports and projections, and counseled patients on treatment options and financial responsibilities."
      ]
    }
  ],
  "volunteer": [
    {
      "organization": "SpokAnimal Animal Shelter",
      "position": "Volunteer",
      "website": "http://spokanimal.org/",
      "startDate": "2009",
      "endDate": "Current",
      "summary": "Implemented and participated in fundraisers, adoption drives, community outreach programs, assisted in adoptions, marketing, foster program, barn cat program, and stray programs. Honored to serve on the \"A\" Team, which is a special training unit that works to train dogs who would otherwise be euthanized.",
      "highlights": []
    },
    {
      "organization": "Spokane Public Schools",
      "position": "Volunteer",
      "website": "",
      "startDate": "2012",
      "endDate": "2014",
      "summary": "Educator in the Newcomer's Center for incoming refugee students; preparing students to integrate into the American High School setting. Participated in the after school homework lab which was inclusive for all ELL students.",
      "highlights": []
    },
    {
      "organization": "House of Charity",
      "position": "Volunteer",
      "website": "http://www.catholiccharitiesspokane.org/house-of-charity",
      "startDate": "2009",
      "endDate": "2012",
      "summary": "Prepared, served, and ate meals with the homeless patrons.",
      "highlights": []
    },
    {
      "organization": "Whidbey Island Dive Center",
      "position": "Volunteer",
      "website": "http://www.whidbeydive.com/",
      "startDate": "1999",
      "endDate": "2003",
      "summary": "Master Diver, Rescue Diver, Diver Training, Dive Lead",
      "highlights": []
    }
  ],
  "education": [
    {
      "institution": "Spokane Community College",
      "area": "General Studies",
      "studyType": "Associate of Arts ",
      "startDate": "2008",
      "endDate": "2012",
      "gpa": "",
      "courses": []
    },
    {
      "institution": "Gonzaga University",
      "area": "Psychology",
      "studyType": "Bachelors of Arts",
      "startDate": "2012",
      "endDate": "2014",
      "gpa": "",
      "courses": []
    },
    {
      "institution": "Gonzaga University",
      "area": "Clinical Mental Health Counseling; CACREP Accredited Program",
      "studyType": "Masters of Arts",
      "startDate": "2014",
      "endDate": "2016",
      "gpa": "",
      "courses": []
    }
  ],
  "awards": [
    {
      "title": "Phi Theta Kappa Member",
      "date": "2012",
      "awarder": "Beta Epsilon Jota",
      "summary": "Academic honors society"
    },
    {
      "title": "Enrichment Scholar Award",
      "date": "2012 & 2013",
      "awarder": "Gonzaga University",
      "summary": "In recognition of distinguished academic achievement"
    },
    {
      "title": "CASE Award Recipient",
      "date": "2012",
      "awarder": "Spokane, Wa.",
      "summary": "Community Advocacy & Service Engagement (CASE) – in recognition of outstanding community service"
    }
  ],
  "publications": [],
  "skills": [],
  "languages": [],
  "interests": [
    {
      "name": "Specialized Training & Credentials",
      "keywords": [
        "Motivational Interviewing (MI)",
        "Cognitive Processing Therapy (CPT)",
        "Prolonged Exposure (PE)",
        "Cognitive Behavioral Therapy (CBT)",
        "Emotion Focused Therapy (EFT)",
        "Level 1 Gottman Trained Therapist",
        "Child-Centered Play Therapy",
        "Suicide Prevention Training",
        "Suicide Risk Management for Clinicians",
        "Child and Spousal/Domestic Abuse, Elder Abuse and Neglect",
        "Human Sexuality and Sexual Dysfunction",
        "NIH’s Protecting Human Research Participants Certified",
        "Management of Aggressive Behavior (M.O.A.B.) International Certification",
        "dult and Pediatric Basic CPR, First Aid, Automatic External Defibrillator (AED) and Stroke Certifications",
        "*National Agency Check with Inquiries (NACI); Federal Tier 1"
      ]
    }
  ],
  "references": [
    {
      "name": "Shannon Dunkin, MS, LMHC, NCC",
      "reference": "HUD-VASH Coodinator & Acting HCHV Coordinator, Mann-Grandstaff VA Medical Center"
    },
    {
      "name": "Kimberly McNees, MS, LMHC",
      "reference": "Care Manager & LMHC Training Director at Behavioral Health Services, Mann-Grandstaff VA Medical Center"
    },
    {
      "name": "Paul Hastings Ph.D.",
      "reference": "Associate Professor in Counselor Education at Gonzaga University"
    }
  ]
}