{
    "basics": {
        "name": "Kate Frostad",
        "label": "MA, MHC, NCC",
        "picture": "",
        "email": "katiefrostad@gmail.com",
        "phone": "(509) 994-7257",
        "website": "",
        "summary": "",
        "location": {
            "address": "",
            "postalCode": "96813",
            "city": "Honolulu",
            "countryCode": "US",
            "region": "Hawaii"
        },
        "profiles": []
    },
    "work": [
        {
            "company": "US Department of Veterans Affairs Medical Center, Behavioral Health Services (BHS) and Healthcare for Homeless Veterans (HCHV)",
            "position": "Clinical Mental Health Counseling Intern",
            "website": "http://www.spokane.va.gov",
            "startDate": "21 HRS per week, 08/2015",
            "endDate": "05/2016",
            "summary": "",
            "highlights": [
                "First in the nation to graduate from the VA's newly implemented specialized training program (see cover letter for details) wherein I functioned at a GS 0101-9 capacity, sharing my time between BHS and HCHV locations",
                "Provided individual, couples, co-occurring and group psychotherapy using evidence based practices; both in-office and in the community (outreach primarily under the HUD-VASH program)",
                "Group work included Transgender Transitions, Trauma Symptom Management for Couples, Personal Effectiveness, Finding Solutions for Suicide (the nations only Veteran facilitated peer support group for men) which promotes zero suicide",
                "Provided interdisciplinary clinical case and care management with peer support, substance abuse support, inpatient services, vocational assistance and training programs, physicians, and medication management",
                "Performed weekly intakes; full mental health assessments including diagnoses, service recommendations and referrals",
                "Assisted Veterans in obtaining Service-Connected Disability reimbursement and vocational goals ",
                "Advocated for for female Veterans; specifically in the implementation of a Finding Solutions group",
                "Participation on weekly multidisciplinary team meetings",
                "Collaborated with community partners including Goodwill Industries, Frontier Behavioral Health, Food Banks, homeless shelters, group homes, area hospitals, law enforcement and educational and vocational institutions",
                "Utilized Computerized Patient Record System (CPRS) to provide accurate and timely clinical charting and treatment planning to ensure continuity of care and made appropriate referrals when necessary",
                "Incorporated technologies including VistA Visual Aid, VistAWeb, CPRS including Remote Data View, Joint Legacy Viewer (JLV), VA Time and Attendance System (VATAS), Mental Health Suite, Citrix and VA Talent Management System (TMS)"
            ],
            "address": "4815 N Assembly St, Spokane, WA 99205",
            "supervisor": "Shannon Dunkin",
            "contact_phone": "(509) 435-3313",
            "salary": "$11.23/hr stipend"
        },
        {
            "company": "Frontier Behavioral Health (FBH) at Adult Recovery Services (ARS) and Elder Services",
            "position": "Clinical Mental Health Counseling Intern",
            "website": "http://www.fbhwa.org",
            "startDate": "16 HRS per week, 01/2015",
            "endDate": "08/2015",
            "summary": "FBH is a nonprofit Trauma-Informed Care organization which strives to ensure that individuals of all ages have timely access to mental health services and is the Lead Service Provider in the Regional Support Network. ",
            "highlights": [],
            "address": "107 S Division St, Spokane, WA 99202",
            "supervisor": "Danielle Shawgo",
            "contact_phone": "(509) 710-4979",
            "salary": "$150/mo Stipend"
        },
        {
            "company": "Spent my summer internship at ARS serving individuals diagnosed with severe and persistent mental illnesses with complex needs, and my practicum at Elder Services serving at-risk and isolated older adults.",
            "position": "",
            "website": "",
            "startDate": "",
            "endDate": "",
            "summary": "",
            "highlights": [
                "Provided individual, family, couples, co-occurring and group psychotherapy using evidence based practices both in-office and through community outreach",
                "Group work included Women's Anxiety, Substance Abuse Psycho-education, Substance Abuse Support, Amphetamine Recovery, Art Therapy, Geriatric Men's Support and Elders' Caregiver Support",
                "Provided interdisciplinary clinical case and care management with Psychiatry, Primary Care Physicians, the Crisis Response Team, Hospital Diversion Team, and Peer Support Services",
                "Provided caregiver support including Respite and Kinship Care ",
                "Assisted with smooth transition from long term psychiatric hospitalization/incarceration to independent living",
                "Collaboration with community partners including Division of Child and Family Services, Child Protective Services (CPS), National Adult Protective Services Association (APS), COPES, Police Department, area hospitals including the state psychiatric hospital, foster families, food banks, homeless shelters, group homes and educational and vocational institutions",
                "Utilized ERMA and Relias technologies to provide accurate and timely clinical charting and to ensure continuity of care"
            ],
            "address": "",
            "supervisor": "",
            "contact_phone": "",
            "salary": ""
        },
        {
            "company": "Applied Health Associates",
            "position": "Office Manager",
            "website": "http://www.ahaspokane.com",
            "startDate": "40 HRS per week, 2009",
            "endDate": "2012",
            "summary": "Emphasis on improving health through preventative and restorative care.",
            "highlights": [
                "Hired, trained, mentored and reviewed staff while promoting a warm inclusive work environment",
                "Oversaw facility operations; performed daily reconciliations, scheduled projections, lien processing, insurance coordination, recalls, billing, collections, and accounts payable/receivable",
                "Managed professional credentialing, continuing education, professional  licensure and insurance requirements"
            ],
            "address": "1303 S Grand Blvd, Spokane, WA 99202",
            "supervisor": "Dr. Keith Morehouse",
            "contact_phone": "(509) 979-1054",
            "salary": "$15.50 hourly"
        },
        {
            "company": "White Glove Cleaning Services",
            "position": "Owner/Operator",
            "website": "",
            "startDate": "30 HRS per week, 2006",
            "endDate": "2009",
            "summary": "",
            "highlights": [
                "Provided exceptional cleaning services for families and professionals alike"
            ],
            "address": "",
            "supervisor": "",
            "contact_phone": "",
            "salary": ""
        },
        {
            "company": "Pediatric Therapy Specialists",
            "position": "Business Manager",
            "website": "http://www.spokanecpt.com",
            "startDate": "40 HRS per week, 2003",
            "endDate": "2005",
            "summary": "",
            "highlights": [
                "Supervised staff, meetings, performed internal audits, daily reconciliations, scheduled projections, accounts payable/receivable, coordinated insurance and counseled families on treatment options and financial responsibilities.",
                "Promoted clinical excellence through continuing education, interdisciplinary teamwork and community outreach"
            ],
            "address": "6710 N Country Homes Blvd, Spokane, WA 99208",
            "supervisor": "Anne Fink",
            "contact_phone": "(509) 487-2958",
            "salary": "$15 hourly"
        }
    ],
    "volunteer": [
        {
            "organization": "SpokAnimal Animal Shelter",
            "position": "",
            "website": "http://www.spokanimal.org/",
            "startDate": "2009",
            "endDate": "2016",
            "summary": "Assisted in community outreach programs, marketing, adoptions, the foster program, and barn cat and stray programs.",
            "highlights": []
        },
        {
            "organization": "Spokane Public Schools",
            "position": "",
            "website": "",
            "startDate": "2012",
            "endDate": "2014",
            "summary": "Educator in the Newcomer's Center for incoming refugees preparing students to integrate into the American High School setting and in the after school homework lab which was inclusive for all ELL students.",
            "highlights": []
        },
        {
            "organization": "House of Charity",
            "position": "",
            "website": "http://www.catholiccharitiesspokane.org/house-of-charity",
            "startDate": "2009",
            "endDate": "2012",
            "summary": "Prepared, served, and ate meals with the homeless patrons.",
            "highlights": []
        },
        {
            "organization": "Whidbey Island Dive Center",
            "position": "",
            "website": "http://www.whidbeydive.com/",
            "startDate": "1999",
            "endDate": "2003",
            "summary": "Master Diver, Rescue Diver, Diver Training, Dive Lead",
            "highlights": []
        }
    ],
    "education": [
        {
            "institution": "Gonzaga University",
            "area": "Clinical Mental Health Counseling; CACREP Accredited",
            "studyType": "Masters of Arts",
            "startDate": "2014",
            "endDate": "2016",
            "gpa": "",
            "courses": []
        },
        {
            "institution": "Gonzaga University",
            "area": "Psychology",
            "studyType": "Bachelors of Arts",
            "startDate": "2012",
            "endDate": "2014",
            "gpa": "",
            "courses": []
        }
    ],
    "awards": [
        {
            "title": "CASE Award Recipient",
            "date": "2012",
            "awarder": "Spokane, Wa.",
            "summary": "Community Advocacy & Service Engagement (CASE) – in recognition of outstanding community service"
        },
        {
            "title": "Phi Theta Kappa Member",
            "date": "2012",
            "awarder": "Beta Epsilon Jota",
            "summary": "Academic honors society"
        }
    ],
    "publications": [],
    "skills": [],
    "languages": [],
    "interests": [
        {
            "name": "THERAPEUTIC MODALITIES",
            "keywords": [
                "Motivational Interviewing (MI)",
                "Cognitive Processing Therapy (CPT)",
                "Prolonged Exposure (PE)",
                "Cognitive Behavioral Therapy (CBT)",
                "Emotion Focused Therapy (EFT)",
                "Child-Centered Play Therapy",
                "Gottman Trained Therapist (Level 1)"
            ]
        },
        {
            "name": "Health & Safety",
            "keywords": [
                "Suicide Prevention Training",
                "Suicide Risk Management for Clinicians",
                "Child, Spousal/Domestic, Elder Abuse & Neglect",
                "Human Sexuality and Sexual Dysfunction",
                "NIH’s Protecting Human Research Participants Certified",
                "Management of Aggressive Behavior (M.O.A.B.)",
                "Active Threat Training",
                "CPR (Adult & Pediatric), First Aid",
                "Automatic External Defibrillator (AED)",
                "Stroke Certifications",
                "*National Agency Check with Inquiries; Federal Tier 1"
            ]
        }
    ],
    "references": [],
    "optional_section_titles": {
        "interests": ["Specialized Trainings & Credentials"]
    }
}
